Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
efficientnet-b0 (Model)      (None, 5, 5, 1280)        4049564   
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 3, 3, 32)          368672    
_________________________________________________________________
dropout_11 (Dropout)         (None, 3, 3, 32)          0         
_________________________________________________________________
global_max_pooling2d_11 (Glo (None, 32)                0         
_________________________________________________________________
dense_15 (Dense)             (None, 1013)              33429     
=================================================================
Total params: 4,451,665
Trainable params: 402,101
Non-trainable params: 4,049,564
_________________________________________________________________
